zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32wbxx/drivers/include/stm32wbxx_hal_flash.h
/** @defgroup FLASH_OB_WRP_AREA FLASH WRP Area
  * @{
  */
#define OB_WRPAREA_BANK1_AREAA          0x00000000U  /*!< Flash Area A */
#define OB_WRPAREA_BANK1_AREAB          0x00000001U  /*!< Flash Area B */
/**
  * @}
  */

/** @defgroup FLASH_OB_READ_PROTECTION FLASH Option Bytes Read Protection
  * @{
  */
#define OB_RDP_LEVEL_0                  0x000000AAU
#define OB_RDP_LEVEL_1                  0x000000BBU
#define OB_RDP_LEVEL_2                  0x000000CCU  /*!< Warning: When enabling read protection level 2
                                                          it's no more possible to go back to level 1 or 0 */
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_TYPE FLASH Option Bytes User Type
  * @{
  */
#define OB_USER_BOR_LEV                 (FLASH_OPTR_BOR_LEV)    /*!< BOR reset Level */
#define OB_USER_nRST_STOP               (FLASH_OPTR_nRST_STOP)  /*!< Reset generated when entering the stop mode */
#define OB_USER_nRST_STDBY              (FLASH_OPTR_nRST_STDBY) /*!< Reset generated when entering the standby mode */
#define OB_USER_nRST_SHDW               (FLASH_OPTR_nRST_SHDW)  /*!< Reset generated when entering the shutdown mode */
#define OB_USER_IWDG_SW                 (FLASH_OPTR_IWDG_SW)    /*!< Independent watchdog selection */
#define OB_USER_IWDG_STOP               (FLASH_OPTR_IWDG_STOP)  /*!< Independent watchdog counter freeze in stop mode */
#define OB_USER_IWDG_STDBY              (FLASH_OPTR_IWDG_STDBY) /*!< Independent watchdog counter freeze in standby mode */
#define OB_USER_WWDG_SW                 (FLASH_OPTR_WWDG_SW)    /*!< Window watchdog selection */
#define OB_USER_nBOOT1                  (FLASH_OPTR_nBOOT1)     /*!< Boot configuration */
#define OB_USER_SRAM2PE                 (FLASH_OPTR_SRAM2PE)    /*!< SRAM2 parity check enable     */
#define OB_USER_SRAM2RST                (FLASH_OPTR_SRAM2RST)   /*!< SRAM2 erase when system reset */
#define OB_USER_nSWBOOT0                (FLASH_OPTR_nSWBOOT0)   /*!< Software BOOT0 */
#define OB_USER_nBOOT0                  (FLASH_OPTR_nBOOT0)     /*!< nBOOT0 option bit */
#define OB_USER_AGC_TRIM                (FLASH_OPTR_AGC_TRIM)   /*!< Automatic Gain Control Trimming */
#define OB_USER_ALL                     (OB_USER_BOR_LEV    | OB_USER_nRST_STOP | OB_USER_nRST_STDBY | \
                                         OB_USER_nRST_SHDW  | OB_USER_IWDG_SW   | OB_USER_IWDG_STOP  | \
                                         OB_USER_IWDG_STDBY | OB_USER_WWDG_SW   | OB_USER_nBOOT1     | \
                                         OB_USER_SRAM2PE    | OB_USER_SRAM2RST  | OB_USER_nSWBOOT0   | \
                                         OB_USER_nBOOT0     | OB_USER_AGC_TRIM)   /*!< all option bits */

/**
  * @}
  */

/** @defgroup FLASH_OB_USER_AGC_TRIM FLASH Option Bytes Automatic Gain Control Trimming
  * @{
  */
#define OB_AGC_TRIM_0                   0x00000000U                                                              /*!< Automatic Gain Control Trimming Value 0 */
#define OB_AGC_TRIM_1                   (FLASH_OPTR_AGC_TRIM_0)                                                  /*!< Automatic Gain Control Trimming Value 1 */
#define OB_AGC_TRIM_2                   (FLASH_OPTR_AGC_TRIM_1)                                                  /*!< Automatic Gain Control Trimming Value 2 */
#define OB_AGC_TRIM_3                   (FLASH_OPTR_AGC_TRIM_1 | FLASH_OPTR_AGC_TRIM_0)                          /*!< Automatic Gain Control Trimming Value 3 */
#define OB_AGC_TRIM_4                   (FLASH_OPTR_AGC_TRIM_2)                                                  /*!< Automatic Gain Control Trimming Value 4 */
#define OB_AGC_TRIM_5                   (FLASH_OPTR_AGC_TRIM_2 | FLASH_OPTR_AGC_TRIM_0)                          /*!< Automatic Gain Control Trimming Value 5 */
#define OB_AGC_TRIM_6                   (FLASH_OPTR_AGC_TRIM_2 | FLASH_OPTR_AGC_TRIM_1)                          /*!< Automatic Gain Control Trimming Value 6 */
#define OB_AGC_TRIM_7                   (FLASH_OPTR_AGC_TRIM_2 | FLASH_OPTR_AGC_TRIM_1 | FLASH_OPTR_AGC_TRIM_0)  /*!< Automatic Gain Control Trimming Value 7 */
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_BOR_LEVEL FLASH Option Bytes User BOR Level
  * @{
  */
#define OB_BOR_LEVEL_0                  0x00000000U                                    /*!< Reset level threshold is around 1.7V */
#define OB_BOR_LEVEL_1                  (FLASH_OPTR_BOR_LEV_0)                         /*!< Reset level threshold is around 2.0V */
#define OB_BOR_LEVEL_2                  (FLASH_OPTR_BOR_LEV_1)                         /*!< Reset level threshold is around 2.2V */
#define OB_BOR_LEVEL_3                  (FLASH_OPTR_BOR_LEV_0 | FLASH_OPTR_BOR_LEV_1)  /*!< Reset level threshold is around 2.5V */
#define OB_BOR_LEVEL_4                  (FLASH_OPTR_BOR_LEV_2)                         /*!< Reset level threshold is around 2.8V */
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_nRST_STOP FLASH Option Bytes User Reset On Stop
  * @{
  */
#define OB_STOP_RST                     0x00000000U             /*!< Reset generated when entering the stop mode    */
#define OB_STOP_NORST                   (FLASH_OPTR_nRST_STOP)  /*!< No reset generated when entering the stop mode */
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_nRST_STANDBY FLASH Option Bytes User Reset On Standby
  * @{
  */
#define OB_STANDBY_RST                  0x00000000U             /*!< Reset generated when entering the standby mode    */
#define OB_STANDBY_NORST                (FLASH_OPTR_nRST_STDBY) /*!< No reset generated when entering the standby mode */
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_nRST_SHUTDOWN FLASH Option Bytes User Reset On Shutdown
  * @{
  */
#define OB_SHUTDOWN_RST                 0x00000000U             /*!< Reset generated when entering the shutdown mode    */
#define OB_SHUTDOWN_NORST               (FLASH_OPTR_nRST_SHDW)  /*!< No reset generated when entering the shutdown mode */
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_IWDG_SW FLASH Option Bytes User IWDG Type
  * @{
  */
#define OB_IWDG_HW                      0x00000000U           /*!< Hardware independent watchdog */
#define OB_IWDG_SW                      (FLASH_OPTR_IWDG_SW)  /*!< Software independent watchdog */
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_IWDG_STOP FLASH Option Bytes User IWDG Mode On Stop
  * @{
  */
#define OB_IWDG_STOP_FREEZE             0x00000000U             /*!< Independent watchdog counter is frozen in Stop mode  */
#define OB_IWDG_STOP_RUN                (FLASH_OPTR_IWDG_STOP)  /*!< Independent watchdog counter is running in Stop mode */
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_IWDG_STANDBY FLASH Option Bytes User IWDG Mode On Standby
  * @{
  */
#define OB_IWDG_STDBY_FREEZE            0x00000000U              /*!< Independent watchdog counter is frozen in Standby mode  */
#define OB_IWDG_STDBY_RUN               (FLASH_OPTR_IWDG_STDBY)  /*!< Independent watchdog counter is running in Standby mode */
/**
  * @}
  */

