zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32wbxx/drivers/include/stm32wbxx_hal_flash.h
/** @defgroup FLASH_OB_USER_WWDG_SW FLASH Option Bytes User WWDG Type
  * @{
  */
#define OB_WWDG_HW                      0x00000000U           /*!< Hardware window watchdog */
#define OB_WWDG_SW                      (FLASH_OPTR_WWDG_SW)  /*!< Software window watchdog */
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_SRAM2PE FLASH Option Bytes SRAM2 parity check
  * @{
  */
#define OB_SRAM2_PARITY_ENABLE          0x00000000U           /*!< SRAM2 parity check enable  */
#define OB_SRAM2_PARITY_DISABLE         (FLASH_OPTR_SRAM2PE)  /*!< SRAM2 parity check disable */
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_SRAM2RST FLASH Option Bytes SRAM2 erase when system reset
  * @{
  */
#define OB_SRAM2_RST_ERASE              0x00000000U            /*!< SRAM2 erased when a system reset        */
#define OB_SRAM2_RST_NOT_ERASE          (FLASH_OPTR_SRAM2RST)  /*!< SRAM2 is not erased when a system reset */
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_nBOOT1 FLASH Option Bytes User BOOT1 Type
  * @{
  */
#define OB_BOOT1_SRAM                   0x00000000U          /*!< Embedded SRAM is selected as boot space (if BOOT0=1) */
#define OB_BOOT1_SYSTEM                 (FLASH_OPTR_nBOOT1)  /*!< System memory is selected as boot space (if BOOT0=1) */
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_nSWBOOT0 FLASH Option Bytes User Software BOOT0
  * @{
  */
#define OB_BOOT0_FROM_OB                0x00000000U            /*!< BOOT0 taken from the option bit nBOOT0 */
#define OB_BOOT0_FROM_PIN               (FLASH_OPTR_nSWBOOT0)  /*!< BOOT0 taken from PH3/BOOT0 pin         */
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_nBOOT0 FLASH Option Bytes User nBOOT0 option bit
  * @{
  */
#define OB_BOOT0_RESET                  0x0000000U           /*!< nBOOT0 = 0 */
#define OB_BOOT0_SET                    (FLASH_OPTR_nBOOT0)  /*!< nBOOT0 = 1 */
/**
  * @}
  */

/** @defgroup FLASH_OB_PCROP_ZONE FLASH PCROP ZONE
  * @{
  */
#define OB_PCROP_ZONE_A                 0x00000001U  /*!< PCROP Zone A */
#define OB_PCROP_ZONE_B                 0x00000002U  /*!< PCROP Zone B */
/**
  * @}
  */

/** @defgroup FLASH_OB_PCROP_RDP FLASH Option Bytes PCROP On RDP Level Type
  * @{
  */
#define OB_PCROP_RDP_NOT_ERASE          0x00000000U                  /*!< PCROP area is not erased when the RDP level
                                                                          is decreased from Level 1 to Level 0 */
#define OB_PCROP_RDP_ERASE              (FLASH_PCROP1AER_PCROP_RDP)  /*!< PCROP area is erased when the RDP level is
                                                                          decreased from Level 1 to Level 0 (full mass erase) */
/**
  * @}
  */

/** @defgroup FLASH_OB_SECURITY_MODE Option Bytes FLASH Secure mode
  * @{
  */
#define SYSTEM_NOT_IN_SECURE_MODE       0x00000000U       /*!< Unsecure mode: Security disabled  */
#define SYSTEM_IN_SECURE_MODE           (FLASH_OPTR_ESE)  /*!< Secure mode  : Security enabled   */
/**
  * @}
  */

/** @defgroup FLASH_OB_C2_BOOT_REGION CPU2 Option Bytes Reset Boot Vector
  * @{
  */
#define OB_C2_BOOT_FROM_SRAM            0x00000000U          /*!< CPU2 boot from Sram  */
#define OB_C2_BOOT_FROM_FLASH           (FLASH_SRRVR_C2OPT)  /*!< CPU2 boot from Flash */
/**
  * @}
  */
/**
  * @}
  */

/** @defgroup FLASH_SRAM2A_ADDRESS_RANGE RAM2A address range in secure mode
  * @{
  */

#define SRAM2A_START_SECURE_ADDR_0       0x20030000U  /*  When in secure mode 0x20030000 - 0x20037FFF is accessible only by M0 Plus  */
#define SRAM2A_START_SECURE_ADDR_1       0x20030400U  /*  When in secure mode 0x20030400 - 0x20037FFF is accessible only by M0 Plus  */
#define SRAM2A_START_SECURE_ADDR_2       0x20030800U  /*  When in secure mode 0x20030800 - 0x20037FFF is accessible only by M0 Plus  */
#define SRAM2A_START_SECURE_ADDR_3       0x20030C00U  /*  When in secure mode 0x20030C00 - 0x20037FFF is accessible only by M0 Plus  */
#define SRAM2A_START_SECURE_ADDR_4       0x20031000U  /*  When in secure mode 0x20031000 - 0x20037FFF is accessible only by M0 Plus  */
#define SRAM2A_START_SECURE_ADDR_5       0x20031400U  /*  When in secure mode 0x20031400 - 0x20037FFF is accessible only by M0 Plus  */
#define SRAM2A_START_SECURE_ADDR_6       0x20031800U  /*  When in secure mode 0x20031800 - 0x20037FFF is accessible only by M0 Plus  */
#define SRAM2A_START_SECURE_ADDR_7       0x20031C00U  /*  When in secure mode 0x20031C00 - 0x20037FFF is accessible only by M0 Plus  */
#define SRAM2A_START_SECURE_ADDR_8       0x20032000U  /*  When in secure mode 0x20032000 - 0x20037FFF is accessible only by M0 Plus  */
#define SRAM2A_START_SECURE_ADDR_9       0x20032400U  /*  When in secure mode 0x20032400 - 0x20037FFF is accessible only by M0 Plus  */
#define SRAM2A_START_SECURE_ADDR_10      0x20032800U  /*  When in secure mode 0x20032800 - 0x20037FFF is accessible only by M0 Plus  */
#define SRAM2A_START_SECURE_ADDR_11      0x20032C00U  /*  When in secure mode 0x20032C00 - 0x20037FFF is accessible only by M0 Plus  */
#define SRAM2A_START_SECURE_ADDR_12      0x20033000U  /*  When in secure mode 0x20033000 - 0x20037FFF is accessible only by M0 Plus  */
#define SRAM2A_START_SECURE_ADDR_13      0x20033400U  /*  When in secure mode 0x20033400 - 0x20037FFF is accessible only by M0 Plus  */
#define SRAM2A_START_SECURE_ADDR_14      0x20033800U  /*  When in secure mode 0x20033800 - 0x20037FFF is accessible only by M0 Plus  */
#define SRAM2A_START_SECURE_ADDR_15      0x20033C00U  /*  When in secure mode 0x20033C00 - 0x20037FFF is accessible only by M0 Plus  */
#define SRAM2A_START_SECURE_ADDR_16      0x20034000U  /*  When in secure mode 0x20034000 - 0x20037FFF is accessible only by M0 Plus  */
#define SRAM2A_START_SECURE_ADDR_17      0x20034400U  /*  When in secure mode 0x20034400 - 0x20037FFF is accessible only by M0 Plus  */
#define SRAM2A_START_SECURE_ADDR_18      0x20034800U  /*  When in secure mode 0x20034800 - 0x20037FFF is accessible only by M0 Plus  */
#define SRAM2A_START_SECURE_ADDR_19      0x20034C00U  /*  When in secure mode 0x20034C00 - 0x20037FFF is accessible only by M0 Plus  */
#define SRAM2A_START_SECURE_ADDR_20      0x20035000U  /*  When in secure mode 0x20035000 - 0x20037FFF is accessible only by M0 Plus  */
#define SRAM2A_START_SECURE_ADDR_21      0x20035400U  /*  When in secure mode 0x20035400 - 0x20037FFF is accessible only by M0 Plus  */
#define SRAM2A_START_SECURE_ADDR_22      0x20035800U  /*  When in secure mode 0x20035800 - 0x20037FFF is accessible only by M0 Plus  */
#define SRAM2A_START_SECURE_ADDR_23      0x20035C00U  /*  When in secure mode 0x20035C00 - 0x20037FFF is accessible only by M0 Plus  */
#define SRAM2A_START_SECURE_ADDR_24      0x20036000U  /*  When in secure mode 0x20036000 - 0x20037FFF is accessible only by M0 Plus  */
#define SRAM2A_START_SECURE_ADDR_25      0x20036400U  /*  When in secure mode 0x20036400 - 0x20037FFF is accessible only by M0 Plus  */
#define SRAM2A_START_SECURE_ADDR_26      0x20036800U  /*  When in secure mode 0x20036800 - 0x20037FFF is accessible only by M0 Plus  */
#define SRAM2A_START_SECURE_ADDR_27      0x20036C00U  /*  When in secure mode 0x20036C00 - 0x20037FFF is accessible only by M0 Plus  */
#define SRAM2A_START_SECURE_ADDR_28      0x20037000U  /*  When in secure mode 0x20037000 - 0x20037FFF is accessible only by M0 Plus  */
#define SRAM2A_START_SECURE_ADDR_29      0x20037400U  /*  When in secure mode 0x20037400 - 0x20037FFF is accessible only by M0 Plus  */
#define SRAM2A_START_SECURE_ADDR_30      0x20037800U  /*  When in secure mode 0x20037800 - 0x20037FFF is accessible only by M0 Plus  */
#define SRAM2A_START_SECURE_ADDR_31      0x20037C00U  /*  When in secure mode 0x20037C00 - 0x20037FFF is accessible only by M0 Plus  */
#define SRAM2A_FULL_UNSECURE             0x20040000U  /*  The RAM2A is accessible to M0 Plus and M4                                  */

/**
  * @}
  */

/** @defgroup FLASH_SRAM2B_ADDRESS_RANGE RAM2B address range in secure mode
  * @{
  */

