zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32wbxx/drivers/include/stm32wbxx_hal_flash.h
#define SRAM2B_START_SECURE_ADDR_0       0x20038000U  /*  When in secure mode 0x20038000 - 0x2003FFFF is accessible only by M0 Plus  */
#define SRAM2B_START_SECURE_ADDR_1       0x20038400U  /*  When in secure mode 0x20038400 - 0x2003FFFF is accessible only by M0 Plus  */
#define SRAM2B_START_SECURE_ADDR_2       0x20038800U  /*  When in secure mode 0x20038800 - 0x2003FFFF is accessible only by M0 Plus  */
#define SRAM2B_START_SECURE_ADDR_3       0x20038C00U  /*  When in secure mode 0x20038C00 - 0x2003FFFF is accessible only by M0 Plus  */
#define SRAM2B_START_SECURE_ADDR_4       0x20039000U  /*  When in secure mode 0x20039000 - 0x2003FFFF is accessible only by M0 Plus  */
#define SRAM2B_START_SECURE_ADDR_5       0x20039400U  /*  When in secure mode 0x20039400 - 0x2003FFFF is accessible only by M0 Plus  */
#define SRAM2B_START_SECURE_ADDR_6       0x20039800U  /*  When in secure mode 0x20039800 - 0x2003FFFF is accessible only by M0 Plus  */
#define SRAM2B_START_SECURE_ADDR_7       0x20039C00U  /*  When in secure mode 0x20039C00 - 0x2003FFFF is accessible only by M0 Plus  */
#define SRAM2B_START_SECURE_ADDR_8       0x2003A000U  /*  When in secure mode 0x2003A000 - 0x2003FFFF is accessible only by M0 Plus  */
#define SRAM2B_START_SECURE_ADDR_9       0x2003A400U  /*  When in secure mode 0x2003A400 - 0x2003FFFF is accessible only by M0 Plus  */
#define SRAM2B_START_SECURE_ADDR_10      0x2003A800U  /*  When in secure mode 0x2003A800 - 0x2003FFFF is accessible only by M0 Plus  */
#define SRAM2B_START_SECURE_ADDR_11      0x2003AC00U  /*  When in secure mode 0x2003AC00 - 0x2003FFFF is accessible only by M0 Plus  */
#define SRAM2B_START_SECURE_ADDR_12      0x2003B000U  /*  When in secure mode 0x2003B000 - 0x2003FFFF is accessible only by M0 Plus  */
#define SRAM2B_START_SECURE_ADDR_13      0x2003B400U  /*  When in secure mode 0x2003B400 - 0x2003FFFF is accessible only by M0 Plus  */
#define SRAM2B_START_SECURE_ADDR_14      0x2003B800U  /*  When in secure mode 0x2003B800 - 0x2003FFFF is accessible only by M0 Plus  */
#define SRAM2B_START_SECURE_ADDR_15      0x2003BC00U  /*  When in secure mode 0x2003BC00 - 0x2003FFFF is accessible only by M0 Plus  */
#define SRAM2B_START_SECURE_ADDR_16      0x2003C000U  /*  When in secure mode 0x2003C000 - 0x2003FFFF is accessible only by M0 Plus  */
#define SRAM2B_START_SECURE_ADDR_17      0x2003C400U  /*  When in secure mode 0x2003C400 - 0x2003FFFF is accessible only by M0 Plus  */
#define SRAM2B_START_SECURE_ADDR_18      0x2003C800U  /*  When in secure mode 0x2003C800 - 0x2003FFFF is accessible only by M0 Plus  */
#define SRAM2B_START_SECURE_ADDR_19      0x2003CC00U  /*  When in secure mode 0x2003CC00 - 0x2003FFFF is accessible only by M0 Plus  */
#define SRAM2B_START_SECURE_ADDR_20      0x2003D000U  /*  When in secure mode 0x2003D000 - 0x2003FFFF is accessible only by M0 Plus  */
#define SRAM2B_START_SECURE_ADDR_21      0x2003D400U  /*  When in secure mode 0x2003D400 - 0x2003FFFF is accessible only by M0 Plus  */
#define SRAM2B_START_SECURE_ADDR_22      0x2003D800U  /*  When in secure mode 0x2003D800 - 0x2003FFFF is accessible only by M0 Plus  */
#define SRAM2B_START_SECURE_ADDR_23      0x2003DC00U  /*  When in secure mode 0x2003DC00 - 0x2003FFFF is accessible only by M0 Plus  */
#define SRAM2B_START_SECURE_ADDR_24      0x2003E000U  /*  When in secure mode 0x2003E000 - 0x2003FFFF is accessible only by M0 Plus  */
#define SRAM2B_START_SECURE_ADDR_25      0x2003E400U  /*  When in secure mode 0x2003E400 - 0x2003FFFF is accessible only by M0 Plus  */
#define SRAM2B_START_SECURE_ADDR_26      0x2003E800U  /*  When in secure mode 0x2003E800 - 0x2003FFFF is accessible only by M0 Plus  */
#define SRAM2B_START_SECURE_ADDR_27      0x2003EC00U  /*  When in secure mode 0x2003EC00 - 0x2003FFFF is accessible only by M0 Plus  */
#define SRAM2B_START_SECURE_ADDR_28      0x2003F000U  /*  When in secure mode 0x2003F000 - 0x2003FFFF is accessible only by M0 Plus  */
#define SRAM2B_START_SECURE_ADDR_29      0x2003F400U  /*  When in secure mode 0x2003F400 - 0x2003FFFF is accessible only by M0 Plus  */
#define SRAM2B_START_SECURE_ADDR_30      0x2003F800U  /*  When in secure mode 0x2003F800 - 0x2003FFFF is accessible only by M0 Plus  */
#define SRAM2B_START_SECURE_ADDR_31      0x2003FC00U  /*  When in secure mode 0x2003FC00 - 0x2003FFFF is accessible only by M0 Plus  */
#define SRAM2B_FULL_UNSECURE             0x2003FF00U  /*  The RAM2B is accessible to M0 Plus and M4                                  */

/**
  * @}
  */

/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/
/** @defgroup FLASH_Exported_Macros FLASH Exported Macros
  *  @brief macros to control FLASH features
  *  @{
  */

/**
  * @brief  Set the FLASH Latency.
  * @param __LATENCY__ FLASH Latency
  *         This parameter can be one of the following values :
  *     @arg @ref FLASH_LATENCY_0 FLASH Zero wait state
  *     @arg @ref FLASH_LATENCY_1 FLASH One wait state
  *     @arg @ref FLASH_LATENCY_2 FLASH Two wait states
  *     @arg @ref FLASH_LATENCY_3 FLASH Three wait states
  * @retval None
  */
#define __HAL_FLASH_SET_LATENCY(__LATENCY__)    MODIFY_REG(FLASH->ACR, FLASH_ACR_LATENCY, (__LATENCY__))

/**
  * @brief  Get the FLASH Latency.
  * @retval FLASH Latency
  *         Returned value can be one of the following values :
  *     @arg @ref FLASH_LATENCY_0 FLASH Zero wait state
  *     @arg @ref FLASH_LATENCY_1 FLASH One wait state
  *     @arg @ref FLASH_LATENCY_2 FLASH Two wait states
  *     @arg @ref FLASH_LATENCY_3 FLASH Three wait states
  */
#define __HAL_FLASH_GET_LATENCY()               READ_BIT(FLASH->ACR, FLASH_ACR_LATENCY)

/**
  * @brief  Enable the FLASH prefetch buffer.
  * @retval None
  */
#define __HAL_FLASH_PREFETCH_BUFFER_ENABLE()    SET_BIT(FLASH->ACR, FLASH_ACR_PRFTEN)

/**
  * @brief  Disable the FLASH prefetch buffer.
  * @retval None
  */
#define __HAL_FLASH_PREFETCH_BUFFER_DISABLE()   CLEAR_BIT(FLASH->ACR, FLASH_ACR_PRFTEN)

/**
  * @brief  Enable the FLASH instruction cache.
  * @retval none
  */
#define __HAL_FLASH_INSTRUCTION_CACHE_ENABLE()  SET_BIT(FLASH->ACR, FLASH_ACR_ICEN)

/**
  * @brief  Disable the FLASH instruction cache.
  * @retval none
  */
#define __HAL_FLASH_INSTRUCTION_CACHE_DISABLE() CLEAR_BIT(FLASH->ACR, FLASH_ACR_ICEN)

/**
  * @brief  Enable the FLASH data cache.
  * @retval none
  */
#define __HAL_FLASH_DATA_CACHE_ENABLE()         SET_BIT(FLASH->ACR, FLASH_ACR_DCEN)

/**
  * @brief  Disable the FLASH data cache.
  * @retval none
  */
#define __HAL_FLASH_DATA_CACHE_DISABLE()        CLEAR_BIT(FLASH->ACR, FLASH_ACR_DCEN)

/**
  * @brief  Reset the FLASH instruction Cache.
  * @note   This function must be used only when the Instruction Cache is disabled.
  * @retval None
  */
#define __HAL_FLASH_INSTRUCTION_CACHE_RESET()   do { SET_BIT(FLASH->ACR, FLASH_ACR_ICRST);   \
                                                     CLEAR_BIT(FLASH->ACR, FLASH_ACR_ICRST); \
                                                   } while (0)

/**
  * @brief  Reset the FLASH data Cache.
  * @note   This function must be used only when the data Cache is disabled.
  * @retval None
  */
#define __HAL_FLASH_DATA_CACHE_RESET()          do { SET_BIT(FLASH->ACR, FLASH_ACR_DCRST);   \
                                                     CLEAR_BIT(FLASH->ACR, FLASH_ACR_DCRST); \
                                                   } while (0)

/**
  * @}
  */

